In [2]:
import pandas as pd

In [11]:
test_no = 6

def get_data(test_no):
    file1 = f"log{test_no}a.log"
    file2 = f"log{test_no}b.log"
    df1 = pd.read_csv(file1,sep="\t")
    df2 = pd.read_csv(file2,sep="\t")
    
    return df1,df2

In [18]:
df1,df2 = get_data(8)

In [19]:
df1

     T1(onheater):26.79  T2: 26.63  T3(Outside): 23.0000    265.00
0    T1(onheater):26.83  T2: 26.63  T3(Outside): 22.5000    1530.0
1    T1(onheater):26.79  T2: 26.63  T3(Outside): 23.0000    2795.0
2    T1(onheater):26.75  T2: 26.59  T3(Outside): 23.0000    4061.0
3    T1(onheater):26.75  T2: 26.59  T3(Outside): 23.0000    5325.0
4    T1(onheater):26.79  T2: 26.63  T3(Outside): 23.0000    6591.0
..                  ...        ...                   ...       ...
491  T1(onheater):27.32  T2: 26.67  T3(Outside): 23.0000  622754.0
492  T1(onheater):27.28  T2: 26.63  T3(Outside): 23.0000  624020.0
493  T1(onheater):27.28  T2: 26.63  T3(Outside): 23.5000  625286.0
494  T1(onheater):27.32  T2: 26.67  T3(Outside): 23.5000  626550.0
495  T1(onheater):27.28  T2: 26.63  T3(Outside): 23.5000  627816.0

[496 rows x 4 columns]

In [20]:
df2

     T(plate) = 28.39      2.00
0    T(plate) = 28.39    1004.0
1    T(plate) = 28.29    2008.0
2    T(plate) = 28.39    3010.0
3    T(plate) = 28.34    4013.0
4    T(plate) = 28.34    5015.0
..                ...       ...
621  T(plate) = 60.44  623725.0
622  T(plate) = 60.48  624728.0
623  T(plate) = 60.48  625730.0
624  T(plate) = 60.44  626734.0
625  T(plate) = 60.48  627736.0

[626 rows x 2 columns]